examples/render_all_grammars/dot/docs_tutorials_entity_entity.dot
    digraph xtext {
    fontname = "Bitstream Vera Sans"
    fontsize = 8
    node[
        shape=record,
        style=filled,
        fillcolor=aliceblue
    ]
    nodesep = 0.3
    edge[dir=black,arrowtail=empty]


40453224[ label="{EntityModel|}"]

39604040[ label="{Entity|+name:ID\l}"]

40138344[ label="{Property|+name:ID\l}"]

40703304[ label="{*Type|}"]

40168824[ label="{SimpleType|+name:ID\l}"]

39836808[ label="{ID|}"]

39613784[ label="{STRING|}"]

40186968[ label="{BOOL|}"]

40791496[ label="{INT|}"]

40410920[ label="{FLOAT|}"]

40369160[ label="{STRICTFLOAT|}"]

40241080[ label="{NUMBER|}"]

40256632[ label="{BASETYPE|}"]

39840344[ label="{*OBJECT|}"]



40453224 -> 40168824[arrowtail=diamond, dir=both, headlabel="simple_type 0..*"]
40453224 -> 39604040[arrowtail=diamond, dir=both, headlabel="entities 1..*"]
39604040 -> 40138344[arrowtail=diamond, dir=both, headlabel="properties 1..*"]
40138344 -> 40703304[headlabel="type "]
40703304 -> 40168824 [dir=back]
40703304 -> 39604040 [dir=back]
40241080 -> 40369160 [dir=back]
40241080 -> 40791496 [dir=back]
40256632 -> 40241080 [dir=back]
40256632 -> 40410920 [dir=back]
40256632 -> 40186968 [dir=back]
40256632 -> 39836808 [dir=back]
40256632 -> 39613784 [dir=back]
39840344 -> 40256632 [dir=back]

}
